export const month = {
  0: 'Январь',
  1: 'Февраль',
  2: 'Март',
  3: 'Апрель',
  4: 'Май',
  5: 'Июнь',
  6: 'Июль',
  7: 'Август',
  8: 'Сентябрь',
  9: 'Октябрь',
  10: 'Ноябрь',
  11: 'Декабрь'
}

export const QA = [
  {
    question: 'Здравствуйте! Меня зовут Алиса. Я ваш личный помошник по подбору микрозаймов непосредственно в вашем городе. Я вам задам несколько вопросов и по результатам ответов предложу вам самые выгодные варианты для вас.',
    answers: [
      'Да, я с радостью отвечу',
      'Нет, просто покажи мне все варианты'
    ]
  },
  {
    question: 'Вы работаете или трудоустроены?',
    answers: [
      'Да',
      'Нет',
      'Затрудняюсь ответить'
    ]
  },
  {
    question: 'У вас есть задолженности по другим микрозаймам, кредиты в банках или ипотека?',
    answers: ['Да', 'Нет', 'Затрудняюсь ответить']
  },
  {
    question: 'Сколько вам полных лет?',
    answers: [
      'до 18',
      '18-21',
      '22-25',
      '26-30',
      '31-35',
      '36-40',
      '41-45',
      '46-50',
      '50+',
      'Затрудняюсь ответить'
    ]
  },
  {
    question: 'Какую сумму вы хотите занять?',
    answers: [
      'до 1000 руб.',
      '1000 – 3000 руб.',
      '3000 – 5000 руб.',
      'Затрудняюсь ответить'
    ]
  }
]

export const advice = 'Микрозаймы для вас. Рекомендую заполнить несколько заявок, чтобы увеличить шансы на ободрения от кредитных учреждений.'
