export const month = {
  0: 'Январь',
  1: 'Февраль',
  2: 'Март',
  3: 'Апрель',
  4: 'Май',
  5: 'Июнь',
  6: 'Июль',
  7: 'Август',
  8: 'Сентябрь',
  9: 'Октябрь',
  10: 'Ноябрь',
  11: 'Декабрь'
}

export const QA = [
  {
    question: 'Показать все или сделать видимость работы?',
    answers: ['Все', 'Видимость работы']
  },
  {
    question: 'Вопрос2',
    answers: ['Да', 'Нет', 'Наверное']
  },
  {
    question: 'Вопрос3',
    answers: ['Да', 'Нет', 'Наверное']
  },
  {
    question: 'Вопрос4',
    answers: ['Да', 'Нет', 'Наверное']
  }
]

export const advice = "Иди поспи"
